#Вариант 22. Дано число A (>1). Вывести наибольшее из целых чисел K, для которых сумма
#1 + 1/2 + ... + 1/K будет меньше A, и саму эту сумму.

try:
    A = int (input ("Введите число: "))
    if A <= 1:
        print ("Число должно быть больше 1.")
    else:
        K = 1
        s = 0
        while s < A:
            a = 1 / K
            s = s + a
            K = K + 1
        s = s - 1 / K
        K = K - 1
        print ("Наибольшее число:", K)
        print ("Сумма:", s)
except ValueError:
    print ("Ошибка. Попробуй ввести число.")