#Вариант 22. Дано вещественное число Х (|Х|<1) и целое число N (>0). Найти значение выражения
#X - X^3/3 + X^5/5 - ... +(-1)^N X^2N+1/(2N +1). Полученное число является приближенным значением
#функции arctg в точке Х.

try:
    X = float (input ("Введите вещественное число: "))
    N = int (input ("Введите целое число: "))
    if abs(X) >= 1:
        print ("Модуль числа X должно быть меньше 1.")
    elif N <= 0:
        print ("Число N должно быть больше 0.")
    else:
        s = 0
        k = 0
        while k <= N:
            a = ((-1) ** k) * (X ** (2 * k + 1)) / (2 * k + 1)
            s = s + a
            k = k + 1
        print("Приближённое значение arctg(X):", s)
except ValueError:
    print ("Ошибка. Попробуй ввести чило.")