#Вариант 22. Дана строка, состоящая из русских слов, разделенных пробелами (одним или несколькими).
#Найти длину самого длинного слова.

text = input ("Введите какую-нибудь строку: ")
s = text.split()
max = 0
for i in s:
    if len(i) > max:
        max = len(i)
print (max)