#Вариант 22. Дано трехзначное число. Проверить истинность высказывания:
#«Цифры данного числа образуют возрастающую последовательность».

try:
    num = int (input ('Введите трёхзначное число: '))
    if num <= 99 or num > 999:
        print ('Ошибка: число должно быть трёхзначным.')
    else:
        num1 = num % 10
        num2 = (num // 10) % 10
        num3 = (num // 100) % 10
        if num3 >= num2 or num2 >= num1:
            print ('Утверждение неверное.')
        else:
            print ('Цифры данного числа образуют возрастающую последовательность.')
except ValueError:
    print ('Ошибка. Попробуй ввести число.')