#Вариант 22. Дан словарь с произвольным количеством элементов. Выяснить имеется ли в нем элемент
#с ключом «фрукт = яблоко» и если он отсутствует, то добавить его в словарь.
#Вывести на экран первоначальный словарь и измененный.

n = {'name': 'Alice', 'age': 35, 'city': 'New York'}
print (n)
if 'фрукт' not in n:
    n['фрукт'] = 'яблоко'
else:
    n['фрукт'] = 'яблоко'
print (n)
