#Вариант 22. Дан словарь с произвольным количеством элементов. Выяснить имеется ли в нем элемент
#с ключом «фрукт = яблоко» и если он отсутствует, то добавить его в словарь.
#Вывести на экран первоначальный словарь и измененный.

n = {'цветок': 'роза', 'овощ': 'помидор', 'фрукт': 'груша'}
print (n)
if 'фрукт' not in n:
    n['фрукт'] = 'яблоко'
elif n.get('фрукт') != 'яблоко':
    n['фрукт'] = 'яблоко'
print (n)
