#Вариант 22. Дано множество А из N точек (точки заданы своими координатами х, у).
#Среди всех точек этого множества, лежащих во второй четверти, найти точку,
#наиболее удаленную от начала координат. Если таких точек нет, то вывести точку с нулевыми координатами.

import math
N = int(input('Введите количество точек N: '))
X = []
Y = []
for i in range(N):
    x = int(input(f'Введите x для точки {i+1}: '))
    y = int(input(f'Введите y для точки {i+1}: '))
    X.append(x)
    Y.append(y)
m = -1
r = 0
v = 0
for i in range(N):
    if X[i] < 0 and Y[i] > 0:
        d = math.sqrt(X[i]**2 + Y[i]**2)
        if d > m:
            m = d
            r = X[i]
            v = Y[i]
if m == -1:
    print('(0, 0)')
else:
    print(f'Наиболее удаленная точка во второй четверти: ({r}, {v})')