#Вариант 22. Дан список размера N и целые числа К и L (1 < К ≤ L ≤ N).
#Найти среднее арифметическое всех элементов списка, кроме элементов с номерами от К до L включительно.

N = int(input('Введите размер списка: '))
K = int(input('Введите целое число K: '))
L = int(input('Введите целое число L: '))
m = []
for i in range(N):
    m.append(i+1)
s = 0
k = 0
for i in range(N):
    if i < K-1 or i > L-1:
        s += m[i]
        k += 1
print('Среднее арифметическое:', s / k)