# Вариант 22. Средствами языка Python сформировать два текстовых файла (.txt), содержащих по одной последовательности
#из целых положительных и отрицательных чисел. Сформировать новый текстовый файл (.txt) следующего вида,
#предварительно выполнив требуемую обработку элементов:
#Содержимое первого файла:
#Четные элементы:
#Количество четных элементов:
#Среднее арифметическое:

#Содержимое второго файла:
#Нечетные элементы:
#Количество нечетных элементов:
#Сумма положительных элементов:

a = ['5 -8 12 -3 6 9 -10 4']
f1 = open('file1.txt', 'w')
f1.writelines(a)
f1.close()

f1 = open('file1.txt')
k = f1.read()
k = k.split()
for i in range(len(k)):
    k[i] = int(k[i])
f1.close()

n = []
for x in k:
    if x % 2 == 0:
        n.append(x)
count = len(n)
if count > 0:
    s = sum(n) / count
else:
    s = 0

d = []
m = 0
for x in k:
    if x % 2 != 0:
        d.append(x)
    elif x > 0:
        m += x
f2 = open('result.txt', 'w')

f2.write('Содержимое первого файла: ')
for x in k:
    f2.write(str(x) + ' ')
f2.write('\n')
f2.write('Четные элементы: ' + str(n) + '\n')
f2.write('Количество четных элементов: ' + str(count) + '\n')
f2.write('Среднее арифметическое: ' + str(s) + '\n\n')

f2.write('Содержимое второго файла: ')
for x in k:
    f2.write(str(x) + ' ')
f2.write('\n')
f2.write('Нечетные элементы: ' + str(d) + '\n')
f2.write('Количество нечетных элементов: ' + str(len(d)) + '\n')
f2.write('Сумма положительных элементов: ' + str(m))
f2.close()